// Необходимо написать программу, которая из имеющегося массива целых чисел формирует массив из четных чисел. 
// Первоначальный массив будет сгенерирован случайным образом.
// CreateArray(int count);
// FillArray(int[] array, int minValue, int maxValue);
// PrintArray(int[] array);
// EvenNumbers(int[] array);
// Console.WriteLine(PrintArray(array)); 
// Console.WriteLine(PrintArray(EvenNumbers(array))); 

